Revit 2027 API
ExternalService.SupportActivation Property
 Indicates if the service supports activation/deactivation of the servers.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SupportActivation { get; }
Public ReadOnly Property SupportActivation As Boolean
	Get
public:
property bool SupportActivation {
	bool get ();
}
member SupportActivation : bool with get
Property Value
Boolean
Remarks
If this option is set to false, for a single-server only one added(registered) will be considered active. In case of a multi-server service multiple servers cand be added(registered) and all of them will be considered to be active.
An attempt to change the activation state of the servers will lead to an exception.
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace